# Запросы к базе данных

**Цель** — ознакомиться с данными торговой сети и решить поставленные задачи.\
\
**Задачи:**
1. Написать запрос, который покажет, сколько всего денег потратил каждый человек.
2. Написать запрос, который покажет, сколько заказов у каждого человека.
3. Отфильтровать людей по конкретному городу, и показать, сколько раз каждый человек посетил каждую точку (при условии, что некоторые люди посещают больше одной точки).
**Ход решения:**
1. Ознакомиться с данными.
2. Решить поставленные задачи.
3. Вывести результаты каждого запроса.
4. Сделать выводы по каждой из задач.
**Описание данных**\
\
_Таблица orders_ \
\
Содержит данные о заказах:\
`order_num` — номер заказа;\
`client_id` — id клиента;\
`store_name` — имя магазина;\
`price`  — сумма заказа.\
\
_Таблица info_client_ \
\
Содержит информацию о клиентах:\
`client_id` — id клиента;\
`client_name` — имя клиента;\
`city` — имя клиента.

## Подключимся к базе данных, ознакомимся с таблицами

In [1]:
# импортируем библиотеки
import sqlite3
import pandas as pd 
from sqlalchemy import create_engine

In [2]:
# подключаемся к базе
engine = create_engine('sqlite:///task2_sql.db')

In [3]:
# выводим первые строки таблицы sales

query = '''
           SELECT * FROM sales
           LIMIT 5
        '''
pd.io.sql.read_sql(query, con = engine)

   order_num  client_id     store_name  price
0          1          1        Ромашка   1500
1          2          1        Росинка   1100
2          3          1  Рога и копыта    500
3          4          5        Ромашка    800
4          5          5        Росинка    900

In [4]:
# выводим первые строки таблицы client_info

query = '''
           SELECT * FROM client_info
           LIMIT 5
        '''
pd.io.sql.read_sql(query, con = engine)

   client_id      client_name              city
0          1      Иван Петров      Петрозаводск
1          2    Игорь Смирнов   Санкт-Петербург
2          3     Анна Иванова  Великий Новгород
3          4  Ирина Михайлова   Санкт-Петербург
4          5    Виталий Попов      Петрозаводск

##  Напишем запрос, который покажет, сколько всего денег потратил каждый человек

In [5]:
query = '''
           SELECT s.client_id,
                  c.client_name,
                  SUM(s.price) AS sum_all
           FROM sales AS s
           LEFT JOIN client_info AS c ON s.client_id=c.client_id
           GROUP BY s.client_id
           ORDER BY sum_all DESC
        '''
pd.io.sql.read_sql(query, con = engine)

   client_id      client_name  sum_all
0          7      Петр Петров    11100
1          3     Анна Иванова     4550
2          2    Игорь Смирнов     4150
3          1      Иван Петров     3100
4          5    Виталий Попов     1920
5          4  Ирина Михайлова     1850
6          6      Иван Иванов      890

Наибольшую сумму потратил Петр Петров. Наименьшую - Иван Иванов.

## Напишем запрос, который покажет, сколько заказов у каждого человека

In [6]:
query = '''
           SELECT s.client_id,
                  c.client_name,
                  count(s.client_id) AS count_order
           FROM sales AS s
           LEFT JOIN client_info AS c ON s.client_id=c.client_id
           GROUP BY s.client_id
           ORDER BY count_order DESC
        '''
pd.io.sql.read_sql(query, con = engine)

   client_id      client_name  count_order
0          5    Виталий Попов            3
1          2    Игорь Смирнов            3
2          1      Иван Петров            3
3          7      Петр Петров            2
4          4  Ирина Михайлова            2
5          3     Анна Иванова            2
6          6      Иван Иванов            1

Больше всего заказов было у Виталия Попова, Игоря Смирнова и Ивана Петрова.

 ## Напишем запрос, который покажет, сколько раз каждый человек посетил каждую точку в городе Петрозаводск

In [7]:
query = '''
           SELECT s.client_id,
                  c.client_name, 
                  c.city, 
                  s.store_name,
                  count(s.client_id) AS count_order
           FROM sales AS s
           LEFT JOIN client_info AS c ON s.client_id=c.client_id
           WHERE c.city = 'Петрозаводск'
           GROUP BY s.client_id, c.city, s.store_name
        '''
pd.io.sql.read_sql(query, con = engine)

   client_id    client_name          city     store_name  count_order
0          1    Иван Петров  Петрозаводск  Рога и копыта            1
1          1    Иван Петров  Петрозаводск        Ромашка            1
2          1    Иван Петров  Петрозаводск        Росинка            1
3          5  Виталий Попов  Петрозаводск  Рога и копыта            1
4          5  Виталий Попов  Петрозаводск        Ромашка            1
5          5  Виталий Попов  Петрозаводск        Росинка            1

Каждый человек посетил каждую точку в г.Петрозаводск один раз.

## Общие выводы

Исследуя базу данных, удалось сделать следующие выводы:
* Наибольшую сумму потратил Петр Петров. Наименьшую - Иван Иванов.
* Больше всего заказов было у Виталия Попова, Игоря Смирнова и Ивана Петрова.
* Каждый человек посетил каждую точку в г.Петрозаводск один раз.